src/ExternalDataProcessors/КонструкторМоделиЗапроса/КонструкторМоделиЗапроса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExternalDataProcessor>
  <name>КонструкторМоделиЗапроса</name>
  <attributes>
    <name>ИсходныйТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Код1С</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:ExternalDataProcessor>

src/ExternalDataProcessors/КонструкторМоделиЗапроса/Forms/Форма/Module.bsl
#Область ОписаниеПеременных

&НаСервере
Перем 
	Метки,
	МодельТекста
;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Сведения = РеквизитФормыВЗначение("Объект").СведенияОВнешнейОбработке();
	Заголовок = СтрШаблон("%1, вер. %2", Сведения.Наименование, Сведения.Версия);
	ПоказатьЛево = Истина;
	ПоказатьПраво = Истина;
	ПоказатьНиз = Истина;
	ДобавитьОтступы = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РассчитатьПараметры(ЭтотОбъект);
	УстановитьВидимостьДоступность(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТекстЗапросаПриИзменении(Элемент)
	УстановитьВидимостьДоступность(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ТекстМоделиПриИзменении(Элемент)
	УстановитьВидимостьДоступность(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КомпайлерПриИзменении(Элемент)
	УстановитьВидимостьДоступность(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОткрытьКонструкторЗапроса(Команда)
	ОткрытьКонструкторЗапроса();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьЛево(Команда)
	ПоказатьЛево = НЕ ПоказатьЛево;
	УстановитьВидимостьДоступность(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьПраво(Команда)
	ПоказатьПраво = НЕ ПоказатьПраво;
	УстановитьВидимостьДоступность(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьНиз(Команда)
	ПоказатьНиз = НЕ ПоказатьНиз;
	УстановитьВидимостьДоступность(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПолучитьТекстЗапроса(Команда)
	Объект.ТекстЗапроса = ТекстЗапроса(Объект.Код1С, Компайлер);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПолучитьТекстМодели(Команда)
	КомандаПолучитьТекстМоделиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ТекстЗапроса(Код1С, Компайлер)

	Если СтрНачинаетсяС(Код1С, "//@Компайлер") Тогда
		ПерваяСтрока = СтрРазделить(Код1С, Символы.ПС)[0];
		Состав = СтрРазделить(ПерваяСтрока, " ", Ложь);
		ИмяКомпайлера = Состав[1];
		КомпайлерОбъект = Обработки[ИмяКомпайлера].Создать();
	ИначеЕсли ЗначениеЗаполнено(Компайлер) Тогда
		КомпайлерОбъект = Обработки[Компайлер].Создать();
	Иначе
		ВызватьИсключение "Не удалось определить компайлер!";
	КонецЕсли;
	
	ТекстЗапроса = КомпайлерОбъект.ТекстЗапроса(Код1С);
	Возврат ТекстЗапроса;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НовыйПараметры()
	
	Параметры = Новый Структура;
	Параметры.Вставить("Компайлер", "ТекстЗапросаВМодельЗапроса");
	Параметры.Вставить("ПоказатьЛево", Истина);
	Параметры.Вставить("ПоказатьПраво", Истина);
	Параметры.Вставить("ПоказатьНиз", Истина);
	Возврат Параметры;
	
КонецФункции

&НаСервереБезКонтекста
Процедура РассчитатьПараметрыНаСервере(Параметры)
	
	Если НЕ ЗначениеЗаполнено(Параметры.Компайлер) Тогда
		Параметры.Компайлер = "ТекстЗапросаВМодельЗапроса";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьПараметры(Форма)
	
	Параметры = НовыйПараметры();
	ЗаполнитьЗначенияСвойств(Параметры, Форма);
	РассчитатьПараметрыНаСервере(Параметры);
	ЗаполнитьЗначенияСвойств(Форма, Параметры);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДоступность(Форма)
	
	Параметры = Форма;
	Элементы = Форма.Элементы;
	Элементы.КомандаПолучитьТекстМодели.Видимость = ЗначениеЗаполнено(Параметры.Компайлер);
	Элементы.ФормаКомандаПоказатьЛево.Пометка = Параметры.ПоказатьЛево;
	Элементы.ФормаКомандаПоказатьПраво.Пометка = Параметры.ПоказатьПраво;
	Элементы.ФормаКомандаПоказатьНиз.Пометка = Параметры.ПоказатьНиз;
	Элементы.ИсходныйТекстЗапроса.Видимость = Параметры.ПоказатьЛево;
	Элементы.Код1С.Видимость = Параметры.ПоказатьПраво;
	Элементы.ТекстЗапроса.Видимость = Параметры.ПоказатьНиз;

КонецПроцедуры

&НаСервере
Процедура КомандаПолучитьТекстМоделиНаСервере()
	//@skip-check bsl-legacy-check-the-same-global-element-name-for-module-variable
	Перем Параметры;
	Перем ТекстЗапроса;
	
	ОбработкаКомпайлера = Обработки[Компайлер].Создать();
	Параметры = ОбработкаКомпайлера.НовыйПараметры();
	ТекстЗапроса = ТекстЗапросаИз1С(Объект.ИсходныйТекстЗапроса);
	Объект.Код1С = ОбработкаКомпайлера.Сформировать(ТекстЗапроса, Параметры);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТекстЗапросаИз1С(Знач ТекстЗапроса)
	
	ТекстЗапроса = СокрЛП(ТекстЗапроса);
	
	Если СтрНачинаетсяС(ТекстЗапроса, """") Тогда
		НачалоОтрезка = 2;
		ДлинаОтрезка = СтрДлина(ТекстЗапроса) - 1;
		
		Если СтрЗаканчиваетсяНа(ТекстЗапроса, """;") Тогда
			ДлинаОтрезка = ДлинаОтрезка - 2;
		ИначеЕсли СтрЗаканчиваетсяНа(ТекстЗапроса, """") Тогда
			ДлинаОтрезка = ДлинаОтрезка - 1;
		КонецЕсли;
		
		ТекстЗапроса = Сред(ТекстЗапроса, НачалоОтрезка, ДлинаОтрезка);
	КонецЕсли;
	
	Если СтрНайти(ТекстЗапроса, "|") Тогда
		СтрокиТекста = СтрРазделить(ТекстЗапроса, Символы.ПС, Истина);
		
		Для Индекс = 0 По СтрокиТекста.ВГраница() Цикл
			Подстрока = СтрокиТекста[Индекс];
			Если СтрНачинаетсяС(СокрЛ(Подстрока), "|") Тогда
				Позиция = СтрНайти(Подстрока, "|");
				СтрокиТекста[Индекс] = Сред(Подстрока, Позиция+1);
			КонецЕсли;
		КонецЦикла;
		
		ТекстЗапроса = СтрСоединить(СтрокиТекста, Символы.ПС);
	КонецЕсли;
	
	Возврат ТекстЗапроса;

КонецФункции

&НаКлиенте
Асинх Процедура ОткрытьКонструкторЗапроса()
	Перем ТекстЗапроса;
	
	Конструктор = Новый КонструкторЗапроса;
	Конструктор.Текст = Объект.ИсходныйТекстЗапроса;
	ТекстЗапроса = Ждать Конструктор.ОткрытьАсинх();
	Если ТекстЗапроса <> Неопределено Тогда
		Объект.ИсходныйТекстЗапроса = ТекстЗапроса;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
